In [1]:
import json
import pandas as pd
import numpy as np

In [2]:
file_dir = 'Resources/GlobalLandTemperaturesByCountry.csv'
land_temp_country_df = pd.read_csv(file_dir)
land_temp_country_df

,dt,AverageTemperature,AverageTemperatureUncertainty,Country
0,1743-11-01,4.384,2.294,Åland
1,1743-12-01,NaN,NaN,Åland
2,1744-01-01,NaN,NaN,Åland
3,1744-02-01,NaN,NaN,Åland
4,1744-03-01,NaN,NaN,Åland
...,...,...,...,...
577457,"Wednesday, May 1, 2013",19.059,1.022,Zimbabwe
577458,"Saturday, June 1, 2013",17.613,0.473,Zimbabwe
577459,"Monday, July 1, 2013",17.000,0.453,Zimbabwe
577460,"Thursday, August 1, 2013",19.759,0.717,Zimbabwe
577461,"Sunday, September 1, 2013",NaN,NaN,Zimbabwe

In [3]:
temp_df = land_temp_country_df.dropna()

In [4]:
temp_df

,dt,AverageTemperature,AverageTemperatureUncertainty,Country
0,1743-11-01,4.384,2.294,Åland
5,1744-04-01,1.530,4.680,Åland
6,1744-05-01,6.702,1.789,Åland
7,1744-06-01,11.609,1.577,Åland
8,1744-07-01,15.342,1.410,Åland
...,...,...,...,...
577456,"Monday, April 1, 2013",21.142,0.495,Zimbabwe
577457,"Wednesday, May 1, 2013",19.059,1.022,Zimbabwe
577458,"Saturday, June 1, 2013",17.613,0.473,Zimbabwe
577459,"Monday, July 1, 2013",17.000,0.453,Zimbabwe
577460,"Thursday, August 1, 2013",19.759,0.717,Zimbabwe

In [5]:
temp_df.drop(columns=['AverageTemperatureUncertainty'], axis = 1, inplace = True)

/Users/akinsola/opt/anaconda3/lib/python3.8/site-packages/pandas/core/frame.py:4308: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

In [6]:
temp_df.dtypes

dt                     object
AverageTemperature    float64
Country                object
dtype: object

In [10]:
temp_df['dt'] = temp_df[["dt"]].apply(pd.to_datetime)

<ipython-input-10-1259d8450ac6>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  temp_df['dt'] = temp_df[["dt"]].apply(pd.to_datetime)

In [11]:
temp_df.head()

          dt  AverageTemperature Country
0 1743-11-01               4.384   Åland
5 1744-04-01               1.530   Åland
6 1744-05-01               6.702   Åland
7 1744-06-01              11.609   Åland
8 1744-07-01              15.342   Åland

In [12]:
temp_df.dtypes

dt                    datetime64[ns]
AverageTemperature           float64
Country                       object
dtype: object